# TranslationIn Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..TranslationIn Property
GroupTypeId Class See Also
---
"Translation in"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TranslationIn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TranslationIn As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TranslationIn {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace